# Pandas Week 13

# 49. Seleksi Kolom dengan f-String

In [50]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [51]:
#data frame prep
df=pd.read_csv('./datasets/iris.csv')
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

# Seleksi kolom dengan f-String

In [52]:
#Contoh 1 sebelum 
df['SepalWidthCm'].to_frame().head()

   SepalWidthCm
0           3.5
1           3.0
2           3.2
3           3.1
4           3.6

In [53]:
#Contoh 1 sesudah
part = 'Width'
df[f'Sepal{part}Cm'].to_frame().head()

   SepalWidthCm
0           3.5
1           3.0
2           3.2
3           3.1
4           3.6

In [54]:
#contoh 2 sebelum
df[['PetalWidthCm','PetalLengthCm']].head()

   PetalWidthCm  PetalLengthCm
0           0.2            1.4
1           0.2            1.4
2           0.2            1.3
3           0.2            1.5
4           0.2            1.4

In [55]:
#contoh 2 sesudah 
part = 'Petal'
df[[f'{part}WidthCm', f'{part}LengthCm']].head()

   PetalWidthCm  PetalLengthCm
0           0.2            1.4
1           0.2            1.4
2           0.2            1.3
3           0.2            1.5
4           0.2            1.4

f-String digunakan untuk mengganti suatu bagian dari nama kolom seperti contoh diatas, untuk menyeleksi kolom

# 50. Membuat kolom baru dengan looping dan f-string

In [56]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [57]:
#data frame prep
d={'penjual': ['bejo', 'tejo', 'wati','bejo','cecep','tejo','wati','bejo'],
  'barang': ['monitor', 'monitor','keyboard', 'mouse', 'keyboard', 'monitor', 'laptop', 'monitor']}

df=pd.DataFrame(d)
df

  penjual    barang
0    bejo   monitor
1    tejo   monitor
2    wati  keyboard
3    bejo     mouse
4   cecep  keyboard
5    tejo   monitor
6    wati    laptop
7    bejo   monitor

# Membuat kolom baru dengan looping dan f-string

In [58]:
#contoh
cols = ['penjual', 'barang']

for col in cols:
    df[f'count_tiap_{col}'] = df.groupby(col).cumcount()+1
df

  penjual    barang  count_tiap_penjual  count_tiap_barang
0    bejo   monitor                   1                  1
1    tejo   monitor                   1                  2
2    wati  keyboard                   1                  1
3    bejo     mouse                   2                  1
4   cecep  keyboard                   1                  2
5    tejo   monitor                   2                  3
6    wati    laptop                   2                  1
7    bejo   monitor                   3                  4

# 51. Seleksi baris dengan between

In [63]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [64]:
n_rows= 10
n_cols= 5
cols = tuple('ABCDE')

df= pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  9  2  8  1  4
1  4  6  9  4  3
2  7  7  8  6  3
3  4  9  7  9  3
4  1  2  4  2  1
5  1  3  1  4  7
6  4  6  5  1  6
7  7  2  4  7  8
8  8  1  6  4  1
9  3  8  5  9  6

# Seleksi baris dengan between()

In [65]:
#contoh 1
df[df['A'].between(2, 5)]
#nilai yang diisi pada method between diisi dengan skala nilai yang ingin kita seleksi

   A  B  C  D  E
1  4  6  9  4  3
3  4  9  7  9  3
6  4  6  5  1  6
9  3  8  5  9  6

In [66]:
#contoh 2
df[df['A'].between(2, 5, inclusive= False)] 
#inclusive digunakan untuk mengatur apakah nilai awal dan nilai akhirnya diikut sertakan atau tidak.
# Jika False maka nilai 2,5 nya hana sebagai batasan saja

   A  B  C  D  E
1  4  6  9  4  3
3  4  9  7  9  3
6  4  6  5  1  6
9  3  8  5  9  6

note: 
- 2 contoh diatas menyeleksi kolom A 
- nilai paramter inclusive biasanya True

# 52. Transformasi kolom menjadi baris

In [67]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [70]:
d= {
    'kode_area': [123, 456, 789, 321],
    'pabrik' : [4, 2, 5, 0],
    'gudang' : [2, 4, 7, 3],
    'toko' : [64, 32, 15, 24]
}

df=pd.DataFrame(d)
df

   kode_area  pabrik  gudang  toko
0        123       4       2    64
1        456       2       4    32
2        789       5       7    15
3        321       0       3    24

# Transformasi kolom menjadi baris

In [71]:
df= df.melt(id_vars='kode_area',
           var_name= 'jens_bangunan',
           value_name='jumlah')
df

    kode_area jens_bangunan  jumlah
0         123        pabrik       4
1         456        pabrik       2
2         789        pabrik       5
3         321        pabrik       0
4         123        gudang       2
5         456        gudang       4
6         789        gudang       7
7         321        gudang       3
8         123          toko      64
9         456          toko      32
10        789          toko      15
11        321          toko      24

note:
- fungsi melt digunakan untuk mentransformasi kolom menjadi baris 
- fungsi melt membutuhkan setidaknya tiga paramter:
    1. paramter id_vars akan identik dengan kolom primary atau          unik dari suatu data frame
    2. var_name menampung hasil transformasi kolom menjadi baris
    3. value_name nama kolom yang akan menampung nilai-nilai yang        ditampung dalam kolom sebelumnya yang sudah kita                  transformasikan atau yang akan kita transformasikan              menjadi baris

source:https://www.youtube.com/playlist?list=PL2O3HdJI4voGdD_9xhVCTBoDTDNHpajm5 Trs_M